app/views/posts/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
---
          <div class="user_comments">
            <% if post.most_recent_comments.length == 0 %>