app/controllers/posts_controller.rb

  def index
    @posts = Post.where(author_id: params[:user_id])
    @user = User.find(params[:user_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = $1  [["author_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def show
    @post = Post.find(params[:id])
    @user = User.find(params[:user_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]